index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Elm &amp; Elixir</title>
<meta name="author" content="(ФП-Среда)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@3/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@3/css/theme/moon.css" id="theme"/>

<link rel="stylesheet" href="воркшоп-elm-elixir.css"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@3/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Elm &amp; Elixir</h1><h2 class="author">ФП-Среда</h2><p class="date">Created: 2020-03-21 Sat 11:58</p>
</section>

<section>
<section id="slide-org4a22a3e">
<h2 id="org4a22a3e">Elm &amp; Elixir</h2>
<dl>
<dt>Elm</dt><dd>a delightful language for reliable webapps</dd>
<dt>Elixir</dt><dd><p>
a dynamic, functional language designed for building scalable and maintainable applications
</p>
<aside class="notes">
<p>
Сегодня мы вам расскажем про два языка программирования: elm и elixir
</p>

</aside></dd>

</dl>
</section>
</section>
<section>
<section id="slide-orgd194461">
<h2 id="orgd194461">Elm &amp; Elixir</h2>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Elm</th>
<th scope="col" class="org-left">Elixir</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">statically typed</td>
<td class="org-left">dynamically typed</td>
</tr>

<tr>
<td class="org-left">ml-like syntax</td>
<td class="org-left">ruby-like syntax</td>
</tr>

<tr>
<td class="org-left">frontend use</td>
<td class="org-left">backend use</td>
</tr>
</tbody>
</table>
<aside class="notes">
<p>
На первый взгляд эти языки очень сильно разнятся, но их обьединяет одно:
функциональное программирование
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org60400bc">
<h2 id="org60400bc">Функциональный стиль</h2>
<ul>
<li>Данные</li>
<li>Вычисления</li>
<li>Действия</li>

</ul>
</section>
</section>
<section>
<section id="slide-org9bb239f">
<h3 id="org9bb239f">Функциональное программирование</h3>
<dl>
<dt>Данные</dt><dd>неизменяемые факты о событиях внутри или вне системы</dd>

</dl>
</section>
</section>
<section>
<section id="slide-org74f3bb2">
<h3 id="org74f3bb2">Функциональное программирование</h3>
<dl>
<dt>Вычисления</dt><dd>функции, результат которых всегда одинаков при одинаковых аргументах и отражается только
на возвращаемом значении</dd>

</dl>
</section>
</section>
<section>
<section id="slide-orga02ad72">
<h3 id="orga02ad72">Функциональное программирование</h3>
<dl>
<dt>Действия</dt><dd>взаимодействие с I/O или изменение глобального состояния</dd>

</dl>
</section>
</section>
<section>
<section id="slide-org03be5d7">
<h2 id="org03be5d7">Инструменты для работы с данными</h2>
<ul>
<li>Alebraic Data Types</li>
<li>Pattern Matching</li>
<li>Иммутабельные структуры данных</li>

</ul>
</section>
</section>
<section>
<section id="slide-org80bfc46">
<h3 id="org80bfc46">Инструменты для работы с данными</h3>
<dl>
<dt>Algebraic Data Types</dt><dd>способ описания типов данных как композицию других
типов данных</dd>

</dl>
</section>
</section>
<section>
<section id="slide-orge8a8cd9">
<h3 id="orge8a8cd9">Algebraic Data Types</h3>
<dl>
<dt>Product Type</dt><dd><p>
a.k.a. tuple a.k.a. record
</p>
<div class="org-src-container">

<pre><code class="elm" >person =
    { name: String,
      age : Int   }
</code></pre>
</div></dd>
<dt>Coproduct (Sum) Type</dt><dd><p>
a.k.a union
</p>
<div class="org-src-container">

<pre><code class="elm" >boolean = True | False
</code></pre>
</div></dd>

</dl>
</section>
</section>
<section>
<section id="slide-org2b7a326">
<h3 id="org2b7a326">Инструменты для работы с данными</h3>
<dl>
<dt>Pattern Matching</dt><dd>a.k.a. switch выражение на стероидах</dd>
<dt>Destructuring</dt><dd>извлечение данных из ADT со специальным синтаксисом</dd>

</dl>
</section>
</section>
<section>
<section id="slide-orge5f6465">
<h3 id="orge5f6465">Pattern Matching</h3>
<div class="org-src-container">

<pre><code class="elixir" >def fizzbuzz(n) do
  case {rem(n, 3), rem(n,5)} do
    {0, 0} -&gt; "FizzBuzz"
    {0, _} -&gt; "Fizz"
    {_, 0} -&gt; "Buzz"
    _ -&gt; n
  end
end
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org2591b8c">
<h3 id="org2591b8c">Инструменты для работы с данными</h3>
<dl>
<dt>Иммутабельные структуры данных</dt><dd>структуры данных, не поддерживающие изменение</dd>
<dt>Персистентные структуры данных</dt><dd>стурктуры данных, переиспользующие общие
куски между собой</dd>

</dl>
</section>
</section>
<section>
<section id="slide-org163a221">
<h2 id="org163a221">Инструменты для работы с вычислениями</h2>
<ul>
<li>Функции высшего порядка</li>
<li>Композиция функций</li>

</ul>
</section>
</section>
<section>
<section id="slide-org1c9a97e">
<h3 id="org1c9a97e">Инструменты для работы с вычислениями</h3>
<dl>
<dt>Функции высшего порядка</dt><dd>функции как значения - их можно принимать как
аргументы других функций или возвращать как результат</dd>

</dl>
</section>
</section>
<section>
<section id="slide-orga60c997">
<h3 id="orga60c997">Инструменты для работы с вычислениями</h3>
<dl>
<dt>Композиция функций</dt><dd><p>
применение одной функции к результату другой
</p>
<div class="org-src-container">

<pre><code class="elm" >f : a -&gt; b
g : b -&gt; c

h : a -&gt; c
h x = g (f (x))
</code></pre>
</div></dd>

</dl>
</section>
</section>
<section>
<section id="slide-org709fe5c">
<h2 id="org709fe5c">Инструменты для работы с действиями</h2>
<ul>
<li>Данные</li>
<li>Вычисления</li>

</ul>
</section>
</section>
<section>
<section id="slide-org8acfd4c">
<h3 id="org8acfd4c">Внутри любого действия есть вычисления и данные</h3>
</section>
</section>
<section>
<section id="slide-org53f5e19">
<h2 id="org53f5e19">Образ мышления фп</h2>
<ul>
<li>Начинайте с модели данных</li>
<li>Напишите действия</li>
<li>Выделите логику в чистые функции, протестируйте</li>
<li>Повторите</li>

</ul>
</section>
</section>
<section>
<section id="slide-org2d0e783">
<h3 id="org2d0e783">Функциональное вносит простоту</h3>
<ul>
<li>Вычисления вместо действий</li>
<li>Значения вместо переменных</li>

</ul>
</section>
</section>
<section>
<section id="slide-org4a3115c">
<h2 id="org4a3115c">Формат практикума</h2>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js@3/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@3/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }]
});
</script>
</body>
</html>
